Ran Plan for dir: `infra/gcp/terraform/k8s-staging-images` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.artifact_registry["charts"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/charts"
        name                   = "charts"
      ~ update_time            = "2025-05-27T07:59:51.206978Z" -> "2025-07-14T07:55:00.537673Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["cloud-provider-kind"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/cloud-provider-kind"
        name                   = "cloud-provider-kind"
      ~ update_time            = "2025-05-26T07:53:30.689543Z" -> "2025-07-29T13:44:13.524429Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["csi-vsphere"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/csi-vsphere"
        name                   = "csi-vsphere"
      ~ update_time            = "2025-05-27T05:20:53.695334Z" -> "2025-07-29T06:33:17.854801Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["dra-example-driver"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/dra-example-driver"
        name                   = "dra-example-driver"
      ~ update_time            = "2025-05-22T12:20:06.960460Z" -> "2025-07-18T22:18:55.821871Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["etcd-manager"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/etcd-manager"
        name                   = "etcd-manager"
      ~ update_time            = "2025-04-03T06:36:21.006241Z" -> "2025-07-08T02:51:41.928973Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["gateway-api-inference-extension"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/gateway-api-inference-extension"
        name                   = "gateway-api-inference-extension"
      ~ update_time            = "2025-05-26T19:46:13.541920Z" -> "2025-07-29T17:28:40.985405Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["infra-tools"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/infra-tools"
        name                   = "infra-tools"
      ~ update_time            = "2025-02-08T20:40:17.696115Z" -> "2025-07-27T19:30:22.609656Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["ingress-nginx"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/ingress-nginx"
        name                   = "ingress-nginx"
      ~ update_time            = "2025-05-27T06:50:16.868874Z" -> "2025-07-29T07:46:45.050707Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["jobset"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/jobset"
        name                   = "jobset"
      ~ update_time            = "2025-05-27T08:00:33.344138Z" -> "2025-07-28T21:33:05.936070Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["kueue"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/kueue"
        name                   = "kueue"
      ~ update_time            = "2025-05-27T08:00:25.180101Z" -> "2025-07-29T17:17:10.634149Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["lws"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/lws"
        name                   = "lws"
      ~ update_time            = "2025-05-26T19:45:50.540495Z" -> "2025-07-29T12:34:50.188769Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifact_registry["secrets-store-sync"].google_artifact_registry_repository.repo has changed
~ resource "google_artifact_registry_repository" "repo" {
        id                     = "projects/k8s-staging-images/locations/us-central1/repositories/secrets-store-sync"
        name                   = "secrets-store-sync"
      ~ update_time            = "2024-11-21T02:30:34.225098Z" -> "2025-07-17T15:59:08.736717Z"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.artifact_registry["dra-driver-cpu"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us-central1"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-staging-images"
      + repository_id          = "dra-driver-cpu"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-90-days"

          + condition {
              + older_than            = "7776000s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.artifact_registry["dra-driver-cpu"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = "allUsers"
      + project    = "k8s-staging-images"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["dra-driver-cpu"].google_artifact_registry_repository_iam_member.writers["group:k8s-infra-staging-dra-driver-cpu@kubernetes.io"] will be created
+ resource "google_artifact_registry_repository_iam_member" "writers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = "group:k8s-infra-staging-dra-driver-cpu@kubernetes.io"
      + project    = "k8s-staging-images"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.writer"
    }

  # module.artifact_registry["headlamp"].google_artifact_registry_repository_iam_member.writers["group:k8s-infra-staging-headlamp@kubernetes.io"] will be created
+ resource "google_artifact_registry_repository_iam_member" "writers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us-central1"
      + member     = "group:k8s-infra-staging-headlamp@kubernetes.io"
      + project    = "k8s-staging-images"
      + repository = "headlamp"
      + role       = "roles/artifactregistry.writer"
    }

  # module.iam.google_project_iam_binding.project_iam_authoritative["default--roles/viewer"] will be updated in-place
~ resource "google_project_iam_binding" "project_iam_authoritative" {
        id      = "k8s-staging-images/roles/viewer"
      ~ members = [
          + "group:k8s-infra-staging-dra-driver-cpu@kubernetes.io",
          + "group:k8s-infra-staging-headlamp@kubernetes.io",
            # (18 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/gcp/terraform/k8s-staging-images
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Fgcp%252Fterraform%252Fk8s-staging-images%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/gcp/terraform/k8s-staging-images
  ```

**Note: Objects have changed outside of Terraform**
Plan: 4 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```